#coding:utf-8
from django.http import HttpResponse


def mytitles(request):
    html="<html> <body> <h1> <a href='/content1/'>水花44分勇士主场逆转 哈登17+12+8火箭惜负 (click here to get the detail)</a></h1><h1> <a href='/content2/'>双手排球钉板帽!詹皇神补防 绿军球迷看服了(click here to get the detail)</a> </h1></body></html>"
    return HttpResponse(html)

def mycontent1(request):
    html1="<html>" \
          "<body> " \
          "<h1> 水花44分勇士主场逆转哈登17 + 12 + 8火箭惜负 </h1>" \
          "<h2><a href='http://sports.sina.com.cn/basketball/nba/2017-04-01/doc-ifycwyns4168962.shtml'>进入原网址 " \
          "2017年04月01日13:06   </a></h2>" \
          "<h3> 北京时间4月1日，勇士在主场以107 - 98逆转火箭，四天内两度击败他们。勇士（62 - 14）取得10连胜, 联盟第一的位置不变。斯蒂芬 - 库里拿下了24分、7个篮板和5次助攻，克雷 - 汤普森20分8个篮板，安德烈 - 伊戈达拉14分、5个篮板和5次助攻，贾维尔 - 麦基13分，德雷蒙德 - 格林6分、8次助攻和6个篮板。 </h3> " \
          "<h4> <a href='/title/'>go back </a></h4>"\
          "</body>" \
          "</html>"

    return HttpResponse(html1)
def mycontent2(request):
    html2="<html>" \
          "<body> " \
          "<h1> 双手排球钉板帽!詹皇神补防 绿军球迷看服了 </h1>" \
          "<h2><a href='http://sports.sina.com.cn/basketball/nba/2017-04-06/doc-ifyeceza1339681.shtml'>进入原网址 " \
          "2017年04月01日13:06   </a></h2>" \
          "<h3> 北京时间4月6日，东区榜首大战，克利夫兰骑士在缺少主力中锋特里斯坦-汤普森的情况下，依然114-91大比分击败波士顿凯尔特人。勒布朗-詹姆斯展现出联盟第一人的统治力，除了22投14中，拿到了36分10个篮板和6次助攻之外，还用一记毁天灭地般的双手封盖，征服了对方球这一球发生在第二节比赛进行到还剩6分55秒时，当时詹姆斯刚刚率领众替补以一波20-4的狂攻，将场上分差拉开到15分。凯尔特人替补控卫马库斯-斯马特瞅准对方立足未稳，突然加速冲向尚未布置好的阵地防线，想要偷袭两分然而，他显然还是低估了詹姆斯的欲望和爆炸力。这球詹姆斯既不是对位防守者，也没有守在内线，而是洞悉对方意图之后，从罚球区回撤，在对方起跳之后，后发先至，高举双臂，在空中等待对手，用一记排球中拦网一般的技术动作，将斯马特的出手结结实实地封了下来。完成这记震慑人心的封盖之后，詹姆斯由于巨大的势能直接冲进了篮架后的观众席，而作为敌对方的球迷，坐在附近的几位观众也被詹皇风采所折服，忘却敌我之分，伸手和他击掌相庆。这就是超级巨星的风采和魅力，也只有詹姆斯，科比，乔丹等寥寥数人能够在客场享受到这般待遇！ </h3> " \
          "<h4> <a href='/title/'>go back </a></h4>" \
          "</body>" \
          "</html>"

    return HttpResponse(html2)